app/controllers/gamecontents_controller.rb

SELECT "gamecontents".* FROM "gamecontents"
---
  def index
    @gamecontents = Gamecontent.all

INSERT INTO "gamecontents" ("coin", "die", "points", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @gamecontent = Gamecontent.new(gamecontent_params)

    respond_to do |format|
      if @gamecontent.save

DELETE FROM "gamecontents" WHERE "gamecontents"."id" = ?  [["id", 1]]
---
  def destroy
    @gamecontent.destroy

SELECT "gamecontents".* FROM "gamecontents" WHERE "gamecontents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gamecontent
      @gamecontent = Gamecontent.find(params[:id])