app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email_address: params[:user][:email_address])

    # If the user does not exist
    if !user
      flash[:notice] = "This user does not exist. Please set up a new user."
      render :new, status: :unprocessable_entity
    # If the users password does not match
    elsif user.password != params[:user][:password]
      flash[:notice] = "Incorrect password."
      render :new, status: :unprocessable_entity
    # Successful Sign in
    elsif user.present? && user.password == params[:user][:password]
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = ? LIMIT ?  [["email_address", "Test"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]