app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email_address", "password", "created_at", "updated_at", "points", "coin", "die") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.points = 0
    @user.coin = "item: :coin, denomination: 0.25\nitem: :coin, denomination: 0.25\nitem: :coin, denomination: 0.25"
    @user.die = "item: :die, sides: 6, colour: :white\nitem: :die, sides: 6, colour: :white\nitem: :die, sides: 6, colour: :white\n"

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 55]]
---
  def destroy

    # Sign out user before destroying their account
    session[:user_id] = nil

    @user.destroy